In [1]:
import pandas as pd

# Selecting Rows

In [2]:
# Sample DataFrame
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Rohit"],
    "Age": [21, 25, 23, 29],
    "City": ["Pune", "Mumbai", "Nashik", "Pune"],
    "Salary": [50000, 65000, 55000, 70000]
})

df

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000
2   Sara   23  Nashik   55000
3  Rohit   29    Pune   70000

## Part 1: `.loc[]` -> Label based row selection

`.loc[]` uses the index labels (default 0, 1, 2, ....)

1. Selecting single row -> `.loc[i]` where i in index which is 0-3 in the taken ex
2. Selecting multiple rows -> `.loc[i:j]` The range from i to j is gonna selected (The j in included i.e. end index in included)
3. Select rows + columns -> `.loc[i, "col_name"]` or `.loc[i, ["col1", "col2"]]` or we can also do slicing of columns `.loc[i:j, "col_i":"col_j"]`
4. Selecting rows with custom label -> If the df has custom index `df.set_index("Name")` -- `df.loc["Onkar"]` or we can also select multiple `df.loc["Name", "City"]`

### 1. Selecting a single row

In [3]:
df.loc[0]

Name      Onkar
Age          21
City       Pune
Salary    50000
Name: 0, dtype: object

### 2. Selecting multiple rows (using label range)

In [4]:
df.loc[0:2]

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000
2   Sara   23  Nashik   55000

### 3. Select rows + specific columns

In [5]:
df.loc[0:2, "Name":"City"]

    Name  Age    City
0  Onkar   21    Pune
1   Amit   25  Mumbai
2   Sara   23  Nashik

### 4. Select rows based on index labels (custom index example)

In [6]:
df2 = df.set_index("Name")
df2

       Age    City  Salary
Name
Onkar   21    Pune   50000
Amit    25  Mumbai   65000
Sara    23  Nashik   55000
Rohit   29    Pune   70000

In [10]:
# df.loc["Onkar"] 
# This is not possible cause the "Onkar" isn't the label the df has default index (0, 1, 2, 3,...)
# but for df2 we `.set_index("Name")` so the name column is index so "onkar" becomes label
df2.loc["Onkar"]

Age          21
City       Pune
Salary    50000
Name: Onkar, dtype: object

## Part 2: `.iloc[]` -> Position based row selection

`.iloc[]` uses row positions -- 0 = First row, 1 = Second row,.....

### 1. Select a single row by position

In [13]:
df.iloc[0]    # 0 - first row

Name      Onkar
Age          21
City       Pune
Salary    50000
Name: 0, dtype: object

### 2. Select multiple rows by slicing

`.iloc[i:j]`  
Here the j in excluded so the i to j-1 is returned

In [14]:
df.iloc[0:2]

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000

### 3. Select rows + columns by position

In [15]:
df.iloc[0:2, :]

    Name  Age    City  Salary
0  Onkar   21    Pune   50000
1   Amit   25  Mumbai   65000

In [17]:
df.iloc[:2, 2:]

     City  Salary
0    Pune   50000
1  Mumbai   65000

Try for df2

In [23]:
df2

       Age    City  Salary
Name
Onkar   21    Pune   50000
Amit    25  Mumbai   65000
Sara    23  Nashik   55000
Rohit   29    Pune   70000

In [24]:
df2.iloc[:2, 2:]

       Salary
Name
Onkar   50000
Amit    65000

So the df have 4 columns ["Name", "Age", "City", "Salary"] and df2 also but the df2 has set the "Name" column as index so the slicing will not work same for both DataFrames.  
df -> 4 columns  
df2 -> 3 columns. "Name" column is a index and rest are columns

| Task | `.loc[]` | `.iloc[] ` |
| -------- | -------- | --------- |
| Based on | label | int position |
| Include end index | Yes | No |
| Use col names | Yes | No |
| Use row number | No (Yes when default) | Yes |